<?
// для реплик не по теме
define("HELLO_REG", "/(^привет$)|(^здравствуй$)|(^здравствуйте$)|(^hello$)|(^hi$)|(^приветствую$)/i");

// general
define("VARIABLES_REG", "/.*перемен.*/i");
define("TRIGGERS_REG", "/(.*отследи.*измен.*)|(.*обработ.*измен.*)/i");
define("PRIMARY_KEY_REG", "/(^что.*первич.*ключ.*)|(.*скаж.*первич.*ключ.*)/i");
define("FOREIGN_KEY_REG", "/(.*внешн.*ключ.*)|(.*ключ.*внешн.*)/i");
// conditions
define("HAVING_REG", "/(.*отфильтр.*строк.*получен.*агрегат.*)|(.*фильтр.*строк.*получен.*агрегат.*)/i");
define("WHERE_REG", "/(.*добав.*усл.*запро.*)|(.*зада.*усл.*запро.*)|(.*усл.*в.*запро.*)/i");
// operators & functions
define("GROUP_BY_REG", "/(.*общ.*количеств.*для кажд.*)|(.*для кажд.*)/i");
define("IN_EXISTS_INTER_REG", "/.*(те)\s.*строк.*есть.*друг.*табл.*/i");
define("JOIN_REG", "/(.*соедин.*табл.*)|(.*соедин.*нескольк.*табл.*)|(.*join.*?)/i");
define("SELECT_FROM_SELECT_REG", "/(.*выбор.*из.*выбор.*)|(.*подзапрос.*)|(.*запрос.*в.*запрос.*?)/i");
define("ORDER_BY_REG", "/(.*сортиров.*по\s.*возраст.*)|(.*сортиров.*)/i");
define("AGREGATE_REG", "/(.*получ.*итог.*знач.*)|(.*найти количество.*)|(.*вывести количество.*)|(.*найти миним.*)|(.*найти максим.*)|(.*найти сред.*)|(.*найти сумму.*)|(.*вывести сумму.*)/i");
define("UNION_REG","/(.*объедин.*запросы.*)|(.*объедин.*запроса.*)|(.*объедин.*запросов.*)/i");
// wiki
define("SQL_DEFINITION_REG", "/(.*такое.*язык.*sql.*)|(.*знач.*язык.*sql.*)|(.*такое.*sql.*)|(.*знач.*sql.*)/i");
// user questions
define("VARCHAR_PK_REG", "/.*varchar.*первичн.*ключ.*?/i");

?>
